comparedDBs/performance_test_scripts/leveldb_scripts/leveldb_zipf/divider_1/value_size_1024/leveldb_0.25B_val_1024_zipf_{1.3}.log
../../../../KV_stores/leveldb/build/db_bench --db=/mnt/nvme/level8B --num=250000000 --value_size=1024 --batch_size=1000 --benchmarks=fillzipf,stats --range=250000000 --logpath=/mnt/ssd --bloom_bits=10 --log=1 --cache_size=8388608 --open_files=40000 --stats_interval=25000000 --histogram=1 --write_buffer_size=67108864 --data_file=/home/wangzizhao/workloads/zipf_keys0.25B_zipf1.3.csv --max_file_size=67108864 --print_wa=true 
Keys:       16 bytes each
Values:     1024 bytes each (512 bytes after compression)
Entries:    250000000
RawSize:    247955.3 MB (estimated)
FileSize:   125885.0 MB (estimated)
WARNING: Optimization is disabled: benchmarks unnecessarily slow
WARNING: Assertions are enabled; benchmarks unnecessarily slow
WARNING: Snappy compression is not enabled
------------------------------------------------
2024-02-04 16:43:49 ... thread 0: (25000000,25000000) ops and (72804.5,72804.5) ops/second in (343.385374,343.385374) seconds

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        1       63       182        0     24902
  1        1       33        40    24839      1813
  2        3      139        69     9563      8960
  3       10      599        32     4686      4248
user_io:25089.700 total_ios: 39921.754 WriteAmplification: 1.5912

2024-02-04 16:50:03 ... thread 0: (25000000,50000000) ops and (66770.2,69656.9) ops/second in (374.418413,717.803787) seconds

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        4      251       371        0     50117
  1        1       33        80    49866      3485
  2        4      154       144    19679     18535
  3       17     1099        86    12276     11220
user_io:50304.851 total_ios: 83357.536 WriteAmplification: 1.6570

2024-02-04 16:56:13 ... thread 0: (25000000,75000000) ops and (67723.4,69000.3) ops/second in (369.148663,1086.952450) seconds

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        7      439       554        0     75269
  1        1       33       120    74830      5155
  2        4      169       217    29501     27847
  3       24     1464       141    20240     18405
user_io:75457.276 total_ios: 126675.918 WriteAmplification: 1.6788

2024-02-04 17:02:23 ... thread 0: (25000000,100000000) ops and (67503.5,68619.9) ops/second in (370.351429,1457.303879) seconds

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        2      125       740        0    100484
  1        1       34       160   100359      6862
  2        4      167       289    39526     37153
  3       28     1740       195    27655     25431
  4        4      239         2      395       310
user_io:100672.428 total_ios: 170240.437 WriteAmplification: 1.6910

2024-02-04 17:08:35 ... thread 0: (25000000,125000000) ops and (67282.5,68348.2) ops/second in (371.567748,1828.871627) seconds

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        4      251       925        0    125637
  1        1       33       200   125386      8534
  2        5      182       361    49669     46471
  3       30     1756       251    35298     32777
  4       12      758         2      395       310
user_io:125824.850 total_ios: 213729.060 WriteAmplification: 1.6986

2024-02-04 17:15:08 ... thread 0: (25000000,150000000) ops and (63556.9,67500.1) ops/second in (393.348231,2222.219858) seconds

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        5      314      1112        0    150852
  1        1       34       240   150538     10213
  2        5      175       436    59778     56127
  3       32     1960       323    45419     42111
  4       16      995         4      524       433
user_io:151039.996 total_ios: 259735.959 WriteAmplification: 1.7197

2024-02-04 17:21:58 ... thread 0: (25000000,175000000) ops and (61014.9,66490.5) ops/second in (409.735852,2631.955710) seconds

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        4      251      1298        0    176004
  1        1       34       279   175753     11895
  2        6      160       511    69953     65763
  3       31     1977       406    56830     52898
  4       24     1493        12     1652      1543
user_io:176192.424 total_ios: 308102.935 WriteAmplification: 1.7487

2024-02-04 17:28:18 ... thread 0: (25000000,200000000) ops and (65663.3,66385.9) ops/second in (380.730181,3012.685891) seconds

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        3      188      1483        0    201219
  1        1       33       319   201031     13580
  2        4      178       583    79966     75181
  3       28     1713       461    64266     59646
  4       34     2137        23     3011      2897
user_io:201407.572 total_ios: 352523.256 WriteAmplification: 1.7503

2024-02-04 17:34:40 ... thread 0: (25000000,225000000) ops and (65500.6,66286.4) ops/second in (381.675783,3394.361674) seconds

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        4      251      1668        0    226372
  1        1       33       359   226121     15255
  2        4      146       658    90204     84838
  3       34     1974       522    72911     67492
  4       35     2201        25     3353      3238
user_io:226559.991 total_ios: 397194.232 WriteAmplification: 1.7532

2024-02-04 17:40:54 ... thread 0: (25000000,250000000) ops and (66846.6,66342.0) ops/second in (373.990737,3768.352411) seconds

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        0        0      1852        0    251587
  1        1       34       400   251587     16958
  2        4      142       728   100086     94048
  3       25     1456       585    81084     75071
  4       50     3161        25     3353      3238
user_io:251775.145 total_ios: 440902.983 WriteAmplification: 1.7512

250000000 operations have been finished (247955.329 MB data have been written into db)
fillzipf     :      15.073 micros/op 66341 ops/sec;   65.8 MB/s
Microseconds per op:
Count: 250000000  Average: 15.0734  StdDev: 159.25
Min: 6.0000  Median: 10.2680  Max: 781082.0000
------------------------------------------------------
[       6,       7 )  131049   0.052%   0.052% 
[       7,       8 ) 14788690   5.915%   5.968% #
[       8,       9 ) 43706450  17.483%  23.450% ###
[       9,      10 ) 56094829  22.438%  45.888% ####
[      10,      12 ) 76702529  30.681%  76.569% ######
[      12,      14 ) 38956401  15.583%  92.152% ###
[      14,      16 ) 13627411   5.451%  97.603% #
[      16,      18 ) 2390807   0.956%  98.559% 
[      18,      20 )  908713   0.363%  98.923% 
[      20,      25 ) 1073059   0.429%  99.352% 
[      25,      30 )  380596   0.152%  99.504% 
[      30,      35 )  126295   0.051%  99.555% 
[      35,      40 )   37184   0.015%  99.570% 
[      40,      45 )   18163   0.007%  99.577% 
[      45,      50 )    8724   0.003%  99.580% 
[      50,      60 )    8933   0.004%  99.584% 
[      60,      70 )    6108   0.002%  99.586% 
[      70,      80 )    4062   0.002%  99.588% 
[      80,      90 )    5197   0.002%  99.590% 
[      90,     100 )    5354   0.002%  99.592% 
[     100,     120 )    3284   0.001%  99.594% 
[     120,     140 )    1639   0.001%  99.594% 
[     140,     160 )    1122   0.000%  99.595% 
[     160,     180 )    1094   0.000%  99.595% 
[     180,     200 )     923   0.000%  99.595% 
[     200,     250 )     404   0.000%  99.596% 
[     250,     300 )      72   0.000%  99.596% 
[     300,     350 )      25   0.000%  99.596% 
[     350,     400 )      23   0.000%  99.596% 
[     400,     450 )      17   0.000%  99.596% 
[     450,     500 )       6   0.000%  99.596% 
[     500,     600 )      34   0.000%  99.596% 
[     600,     700 )      16   0.000%  99.596% 
[     700,     800 )       1   0.000%  99.596% 
[     900,    1000 )       1   0.000%  99.596% 
[    1000,    1200 )  800489   0.320%  99.916% 
[    1200,    1400 )  204740   0.082%  99.998% 
[    1400,    1600 )     253   0.000%  99.998% 
[    1600,    1800 )      19   0.000%  99.998% 
[    1800,    2000 )       7   0.000%  99.998% 
[    2000,    2500 )       4   0.000%  99.998% 
[    2500,    3000 )       6   0.000%  99.998% 
[    3000,    3500 )      47   0.000%  99.998% 
[    3500,    4000 )       6   0.000%  99.998% 
[    4000,    4500 )       3   0.000%  99.998% 
[    4500,    5000 )       7   0.000%  99.998% 
[    5000,    6000 )     128   0.000%  99.998% 
[    6000,    7000 )    1183   0.000%  99.998% 
[    7000,    8000 )    2076   0.001%  99.999% 
[    8000,    9000 )     758   0.000% 100.000% 
[    9000,   10000 )     179   0.000% 100.000% 
[   10000,   12000 )     115   0.000% 100.000% 
[   12000,   14000 )      35   0.000% 100.000% 
[   14000,   16000 )      26   0.000% 100.000% 
[   16000,   18000 )      94   0.000% 100.000% 
[   18000,   20000 )     215   0.000% 100.000% 
[   20000,   25000 )     250   0.000% 100.000% 
[   25000,   30000 )      56   0.000% 100.000% 
[   30000,   35000 )      21   0.000% 100.000% 
[   35000,   40000 )       4   0.000% 100.000% 
[   40000,   45000 )       4   0.000% 100.000% 
[   45000,   50000 )       1   0.000% 100.000% 
[   50000,   60000 )       6   0.000% 100.000% 
[   60000,   70000 )       5   0.000% 100.000% 
[   70000,   80000 )       4   0.000% 100.000% 
[   80000,   90000 )       2   0.000% 100.000% 
[   90000,  100000 )       4   0.000% 100.000% 
[  100000,  120000 )       6   0.000% 100.000% 
[  120000,  140000 )       5   0.000% 100.000% 
[  140000,  160000 )       3   0.000% 100.000% 
[  160000,  180000 )       4   0.000% 100.000% 
[  200000,  250000 )       6   0.000% 100.000% 
[  250000,  300000 )       2   0.000% 100.000% 
[  300000,  350000 )       3   0.000% 100.000% 
[  400000,  450000 )       2   0.000% 100.000% 
[  500000,  600000 )       4   0.000% 100.000% 
[  700000,  800000 )       3   0.000% 100.000% 


                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        0        0      1852        0    251587
  1        1       34       400   251587     16958
  2        4      142       728   100086     94048
  3       25     1456       585    81084     75071
  4       50     3161        25     3353      3238
user_io:251775.145 total_ios: 440902.983 WriteAmplification: 1.7512